我创建了两个表， 用来验证 1. 放大表的sql的逻辑是否正确； 2. 发文指标的sql的逻辑是否正确：

表a（模拟join之后得到的feedid和其对应的vv）：
+---------+-------+
| feed_id | vv    |
+---------+-------+
|       1 |  1123 |
|       2 | 11235 |
|       3 |    12 |
|       4 |  2345 |
|       5 |   439 |
|       6 |  4325 |
|       7 |   342 |
|       8 | 29359 |
|       9 | 12034 |
|      10 |   238 |
+---------+-------+

表b（模拟次日/3日/7日还留存的账号id（随便起名为feed_id））：
+---------+
| feed_id |
+---------+
|       3 |
|       4 |
|       5 |
|       8 |
|      10 |
|      12 |
|      15 |
|      16 |
+---------+

left join a表和b表得到：
select * from a left join b on a.feed_id=b.feed_id order by a.feed_id；
+---------+-------+---------+
| feed_id | vv    | feed_id |
+---------+-------+---------+
|       1 |  1123 |    NULL |
|       2 | 11235 |    NULL |
|       3 |    12 |       3 |
|       4 |  2345 |       4 |
|       5 |   439 |       5 |
|       6 |  4325 |    NULL |
|       7 |   342 |    NULL |
|       8 | 29359 |       8 |
|       9 | 12034 |    NULL |
|      10 |   238 |      10 |
+---------+-------+---------+

通过珠心算得到：
vv>1000占比 0.6
vv>10000占比 0.3
发文留存 0.5

---------------------------------------------------------------------------
1. 放大表的sql的逻辑是否正确
select 
        (count(distinct if(a.vv >= 1000, a.feed_id,'0')) - 1)/count(distinct a.feed_id) vv_level_1000,
        (count(distinct if(a.vv >= 10000, a.feed_id,'0')) - 1)/count(distinct a.feed_id) vv_level_10000
from 
    a left join b 
    on a.feed_id=b.feed_id;

+---------------+----------------+
| vv_level_1000 | vv_level_10000 |
+---------------+----------------+
|        0.6000 |         0.3000 |
+---------------+----------------+

正确

---------------------------------------------------------------------------
2. 留存表的sql的逻辑是否正确
select 
        (count(distinct if(b.feed_id is not null,a.feed_id,'')) - 1)/count(distinct a.feed_id) person_repost_within
from 
    a left join b on a.feed_id=b.feed_id;

+----------------------+
| person_repost_within |
+----------------------+
|               0.5000 |
+----------------------+

正确

---------------------------------------------------------------------------
3. 原理
select 
        distinct if(b.feed_id is not null,b.feed_id,"")
from 
    a left join b on a.feed_id=b.feed_id;

+----------------------------------------+
| if(b.feed_id is not null,b.feed_id,"") |
+----------------------------------------+
| 3                                      |
| 4                                      |
| 5                                      |
| 8                                      |
| 10                                     |
|                                        |
+----------------------------------------+

if函数将为null的 b.feed_id 都转化为""，即空的字段，前面的distinct 函数将所有的"" (即null的 b.feed_id)变成了一个""，如上表所示。故要-1，放大表和留存表同理。